# Data Cleaning

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [2]:
df['FlightNumber']= [1045+(10*i) for i in range(0,5)]
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris          1045      [23, 47]               KLM(!)
1      MAdrid_miLAN          1055            []    <Air France> (12)
2  londON_StockhOlm          1065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          1075          [13]       12. Air France
4   Brussels_londOn          1085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [3]:
temp_df=pd.DataFrame()
temp_df=df['From_To'].str.split('_',n=1,expand=True)
temp_df.columns=['From','To']
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [4]:
temp_df['From']=temp_df['From'].str.capitalize()
temp_df['To']=temp_df['To'].str.capitalize()
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [5]:
df= pd.concat([temp_df,df],axis=1,join='inner')
df=df.drop('From_To',axis=1)
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris          1045      [23, 47]               KLM(!)
1    Madrid      Milan          1055            []    <Air France> (12)
2    London  Stockholm          1065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris          1075          [13]       12. Air France
4  Brussels     London          1085      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [6]:
temp_df1=pd.DataFrame()
temp_df1=df['RecentDelays']
temp_df1=pd.DataFrame(temp_df1.values.tolist())
df=pd.concat([df,temp_df1],axis=1,join='inner')
df.columns=['From','To','FlightNumber','RecentDelays','Airline','Delay_1','Delay_2','Delay_3']
df

,From,To,FlightNumber,RecentDelays,Airline,Delay_1,Delay_2,Delay_3
0,London,Paris,1045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid,Milan,1055,[],<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,1065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,1075,[13],12. Air France,13.0,NaN,NaN
4,Brussels,London,1085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN